// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
//#include <cmath>
using namespace std;
int j, k;
int main()
{
    double a, b, c, d, e, g = 9.812; cin >> d; cout << pow(d, 0.5) << '\n' << 'k';/* a = b = c = d = e = 1;
    for (a; a < 150; a += 1) {
        for (b; b < 150; b += 1) {
            for (c; c < 150; c += 1) {
                for (d; d < 150; d += 1) {
                    for (e; e < 150; e += 1) {
                        if ((pow(a, 5) + pow(a, 5) + pow(a, 5) + pow(a, 5) + pow(a, 5))==pow(e,5)) {
                            cout << a << '\n' << b << '\n' << c << '\n' << d << '\n' << e << '\n' << a+b+c+d+e << '\n';
                        }
                    }
                }
            }
        }
    }*/
    
    /*
    for (m=1; m <= jy; m++) {
        cout << m*g << endl;
        cout << m*g*0.17 << '\n';
        c++;
        if (c==25){
            c = 0;
        }
    }
    */
    
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
