// Experiments.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <windows.h>
#include <locale.h>
using namespace std;
int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	setlocale(LC_ALL, "Russian");

	double R1, R2, R3, R; 
	
	cout << "R1="; cin >> R1;
	cout << "R2="; cin >> R2;
	cout << "R3="; cin >> R3;

	if (R1 < 0 || R2 < 0 || R3 < 0) cout << "Ошибка ввода чисел";
	else if (R1 == 0 || R2 == 0 || R3 == 0) cout << "Сопротивление сопротивления равно 0";
	
	else { 
		R = 1 / (1 / R1 + 1 / R2 + 1 / R3);
		
		cout << "Сопротивление соединения равно " << R;
	}
	/* ? - это тернарный (троичный) оператор. Он требует трёх операндов. Общий вид: Выраж1 ? Выраж2 : Выраж3;. 
	Проверяется Выраж1, если оно истинно, выполняется Выраж2. Если Выраж1 ложно, выполняется Выраж3.
	*/
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
